# RbsElecApparentLoad Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecApparentLoad Property
ParameterTypeId Class See Also
---
"Apparent Load"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecApparentLoad { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecApparentLoad As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecApparentLoad {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace